tap "barredewe/cask"
tap "felixkratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "sdl2"
brew "openssl@3"
brew "webp"
brew "allegro"
brew "jpeg-xl"
brew "python@3.13"
brew "awscli"
brew "boost"
brew "btop"
brew "catch2"
brew "gcc"
brew "cava"
brew "suite-sparse"
brew "pkgconf"
brew "hdf5"
brew "cmake"
brew "lima"
brew "colima"
brew "conan"
brew "coreutils"
brew "cpp-httplib"
brew "cpr"
brew "cruft"
brew "curl"
brew "docker-compose"
brew "doxygen"
brew "fastfetch"
brew "fd"
brew "harfbuzz"
brew "openjpeg"
brew "tesseract"
brew "ffmpeg"
brew "ffmpeg@6"
brew "mesa"
brew "freeglut"
brew "gcc@12"
brew "libavif"
brew "gd"
brew "ghostscript"
brew "git"
brew "glew"
brew "glslang"
brew "qt"
brew "gnuplot"
brew "go"
brew "govulncheck"
brew "librsvg"
brew "graphviz"
brew "protobuf"
brew "grpc"
brew "gtk+3"
brew "smartmontools"
brew "gsmartcontrol"
brew "hf"
brew "hiredis"
brew "imagemagick"
brew "jq"
brew "openjdk"
brew "kafka"
brew "keydb"
brew "kotlin"
brew "kubernetes-cli"
brew "lazygit"
brew "libpqxx"
brew "llvm"
brew "llvm@16"
brew "lowdown"
brew "make"
brew "md2pdf"
brew "minikube"
brew "molten-vk"
brew "neofetch"
brew "neovim"
brew "neovide"
brew "nginx"
brew "ninja"
brew "nlohmann-json"
brew "node"
brew "nvm"
brew "openvino"
brew "pyqt"
brew "vtk"
brew "opencv"
brew "pandoc"
brew "pipx"
brew "postgresql@14"
brew "postgresql@17"
brew "powerlevel10k"
brew "pygobject3"
brew "python-setuptools"
brew "python-tk@3.12"
brew "qemu"
brew "qpdf"
brew "redis"
brew "ripgrep"
brew "rust"
brew "snow"
brew "spoofdpi"
brew "stow"
brew "thefuck"
brew "tmux"
brew "tree"
brew "typescript"
brew "unciv"
brew "unzip"
brew "vcpkg"
brew "vulkan-headers", link: false
brew "wget"
brew "yt-dlp"
brew "zlib"
brew "zookeeper"
brew "zsh-autocomplete"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
cask "brave-browser"
cask "dbeaver-community"
cask "docker-desktop"
cask "duckduckgo"
cask "eqmac"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-pro"
cask "gstreamer-runtime"
cask "hammerspoon"
cask "iina"
cask "kitty"
cask "libreoffice-language-pack"
cask "librewolf"
cask "monitorcontrol"
cask "mos"
cask "neovide-app"
cask "obs"
cask "obsidian"
cask "redis-insight"
cask "telegram"
cask "visual-studio-code"
cask "vlc"
cask "wine-stable"
cask "zen"
vscode "42crunch.vscode-openapi"
vscode "arjun.swagger-viewer"
vscode "be5invis.vscode-custom-css"
vscode "brandonkirbyson.vscode-animations"
vscode "catppuccin.catppuccin-vsc"
vscode "daylerees.rainglow"
vscode "drcika.apc-extension"
vscode "golang.go"
vscode "juanblanco.solidity"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vsliveshare.vsliveshare"
vscode "njzy.stats-bar"
vscode "redhat.vscode-yaml"
vscode "ritwickdey.liveserver"
vscode "subframe7536.custom-ui-style"
vscode "supermaven.supermaven"
vscode "tomoki1207.pdf"
vscode "zongou.vs-seti-jetbrainsmononerdfontmono"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/melkeydev/go-blueprint"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "halo"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "google.golang.org/protobuf/cmd/protoc-gen-go"
go "google.golang.org/grpc/cmd/protoc-gen-go-grpc"
go "github.com/kyoh86/richgo"
go "honnef.co/go/tools/cmd/staticcheck"
go "golang.org/x/website/tour"
